[
  {
  "name": "ShopHub - E-Commerce Microservices Platform",
  "description": "ShopHub is a full-stack e-commerce platform built with a modern microservices architecture. The application includes a React + TypeScript frontend and multiple backend services (User, Product, and Order) connected through an API Gateway. It supports real-time product browsing, search functionality powered by Elasticsearch, secure JWT-based authentication, shopping cart operations, and order processing with event-driven communication using RabbitMQ. Each service maintains its own database, ensuring loose coupling, scalability, and independent deployment. The project demonstrates containerized deployment using Docker Compose and follows modern software architecture best practices.",
  "technologies": ["React.js","TypeScript","Node.js","Express.js","Python (Flask)","Java (Spring Boot)","MongoDB","PostgreSQL","MySQL","RabbitMQ","Elasticsearch","Docker","REST API"],
  "github": "https://github.com/selinturkdogan/E-commerce-app-microservices",
  "image": "e-commerce.png"
  },
  {
  "name": "Customer Churn Prediction Using Machine Learning",
  "description": "This project focuses on predicting customer churn in a telecommunications company using machine learning and neural network models. The dataset was preprocessed through feature engineering, encoding, scaling, and dimensionality reduction with Principal Component Analysis (PCA), reducing 30 features to 13 principal components while preserving 90% of the variance. Multiple models including Logistic Regression, Random Forest, and a Multi-Layer Perceptron (MLP) were trained and evaluated using Accuracy, Precision, Recall, and F1-score, with particular emphasis on recall due to its business impact. Logistic Regression achieved the best balance between performance and interpretability, making it the most suitable model for identifying potential churn customers and supporting data-driven retention strategies.",
  "technologies": ["Python", "Pandas", "NumPy", "Scikit-learn", "Matplotlib", "Seaborn", "Machine Learning", "PCA", "Neural Networks"],
  "github": "https://github.com/selinturkdogan/Churn-Project",
  "image": "churn project.png"
  },
  {
  "name": "Real Time Chat Application",
  "description": "The Real-Time Chat Application is a web-based messaging system built using Node.js, Express, and Socket.io. The project enables instant private messaging and dynamic group communication between connected users through WebSocket technology. It includes features such as live user tracking, group creation, admin-controlled member management, avatar customization, and real-time message broadcasting. The system operates without a database, storing data in memory during runtime. The architecture follows modular design principles and demonstrates advanced real-time communication patterns in full-stack JavaScript development.",
  "technologies": ["Node.js", "Express.js", "Socket.io", "JavaScript", "HTML", "CSS"],
  "github": "https://github.com/selinturkdogan/realtimeChatApp",
    "image": "chatapp.png"
  },
  {
  "name": "Movie Search Application",
  "description": "The Movie Search Application is a responsive web application built with React and Tailwind CSS that allows users to search for movies and view detailed information in real time. The project integrates an external movie API to dynamically fetch and display movie data, including posters, ratings, release dates, and plot summaries. It also features a favorites system where users can save and manage selected movies. The application follows a component-based architecture and modern frontend development best practices, focusing on clean UI design, dynamic state management, and API integration.",
  "technologies": ["React.js", "JavaScript", "Tailwind CSS", "Node.js", "REST API"],
  "github": "https://github.com/selinturkdogan/movie-search-app",
  "image": "moviesearch.png"
  },
  {
    "name": "Retro Sytle Snake Game",
    "description": "The Retro Snake Game project aims to recreate the nostalgic experience of the classic snake game using Unity and C#. The project’s objective is to deliver a functional, interactive, and visually clean game in which the player controls a snake to collect food and avoid collisions. The system features a score tracking mechanism, game over screen, restart and exit options, and a difficulty selection menu that dynamically adjusts the snake’s speed. The design follows modular principles and adheres to software engineering best practices. The game was built as a stand-alone single-player system with scope for future enhancements such as multiplayer mode and additional game mechanics.",
    "technologies": ["C#", "Unity"],
    "github": "https://github.com/selinturkdogan/Snake-Game",
    "image": "retroSnakeProject.png"
  },
  {
    "name": "Portfolio Website",
    "description": "This personal portfolio website is designed to present my professional profile in a clean and user-friendly manner. Built with HTML, CSS, JavaScript, and Node.js, the site offers a responsive layout that works well across different devices. It includes sections for social media links, downloadable CV, certifications, an about me page, and showcases both my technical and soft skills. Additionally, it highlights the foreign languages I speak and features a contact form to facilitate direct communication. JSON is used to handle dynamic content efficiently, ensuring smooth data flow between the front-end and back-end. The project follows best practices for web development, making it scalable and easy to maintain.",
    "technologies": ["HTML", "CSS", "JavaScript", "Node.js", "JSON (as a data format)"],
    "github": "https://github.com/selinturkdogan/MyPortwolio",
    "image": "portfolioProject.png"
  }
]
